'use strict';
/**
 * @ngdoc function
 * @name sbAdminApp.controller:MainCtrl
 * @description
 * # MainCtrl
 * Controller of the sbAdminApp
 */
angular
    .module('sbAdminApp')
    .controller('SmsSearchCtrl',function($scope, $timeout) {
        console.log($scope);
        $scope.smsgrid = {
            paginationPageSizes: [10, 20, 50,100],
            paginationPageSize: 10,
            columnDefs: [
                {displayName: '',name :'0'},
                {displayName: '手机号',name :'1'},
                {displayName: '部门名称',name :'2'},
                {displayName: '业务类型',name :'3'},
                {displayName: '业务ID',name :'4'},
                {displayName: '状态',name :'5'},
                {displayName: '发送渠道',name :'6'},
                {displayName: '发送时间',name :'7'},
                {displayName: '消息内容',name :'8'}
            ]
        };
        $scope.smsgrid.data = [
            [ "1","13510422825", "夸客理财",  "核心业务", "AP2017033015480056000000", "发送成功", "亿美-夸客",  "2017-03-30 15:50:57", "【夸客金融】尊敬的yjf999先生，您已成功申请一笔金额为1,000,000.00元的夸客财富增值计划，合同编号为HT9991。该笔资金将于次日起息。您可登录【夸客优富微信（Quarkfinancegroup）】或登录【夸客优富APP】进行查询。(客服热线400-680-0388)"],
            [ "2", "13510422826",  "运维部",  "监控告警", "AP2017033015480056000000", "发送成功", "亿美-才米",  "2017-03-30 16:50:57",  "【才米公社】1659!!!!!!!!!!"],
            [ "3", "13510422827",  "夸客理财",  "核心业务", "AP2017033015480056000000", "发送成功", "亿美-夸客",  "2017-03-30 16:53:57",  "【夸客金融】尊敬的yjf11先生，您已成功申请一笔金额为6,000,000.00元的夸客财富增值计划，合同编号为HT9992。该笔资金将于次日起息。您可登录【夸客优富微信（Quarkfinancegroup）】或登录【夸客优富APP】进行查询。(客服热线400-680-0388)"],
            [ "4", "13510422828",  "运维部",  "监控告警", "AP2017033015480056000000", "发送成功", "亿美-才米",  "2017-03-30 17:50:57",  "【才米公社】76859!!!!!!!!!!"],
            [ "5", "13510422829",  "夸客理财",  "核心业务", "AP2017033015480056000000", "发送成功", "亿美-夸客",  "2017-03-30 17:55:57",  "【夸客金融】尊敬的yjf229先生，您已成功申请一笔金额为2,000,000.00元的夸客财富增值计划，合同编号为HT9993。该笔资金将于次日起息。您可登录【夸客优富微信（Quarkfinancegroup）】或登录【夸客优富APP】进行查询。(客服热线400-680-0388)"],
            [ "6", "13510422830",  "运维部",  "监控告警", "AP2017033015480056000000", "发送成功", "亿美-才米",  "2017-03-30 18:50:57",  "【才米公社】166759!!!!!!!!!!"],
            [ "7", "13510422831",  "夸客理财",  "核心业务", "AP2017033015480056000000", "发送成功", "亿美-才米",  "2017-03-30 18:50:59",  "【才米公社】19959!!!!!!!!!!"],
            [ "8", "13510422832",  "运维部",  "核心业务", "AP2017033015480056000000", "发送成功", "亿美-才米",  "2017-03-30 19:50:57",  "【才米公社】1688!!!!!!!!!!"],
            [ "9", "13510422833",  "夸客理财",  "监控告警", "AP2017033015480056000000", "发送成功", "亿美-夸客",  "2017-04-30 15:50:57",  "【夸客金融】尊敬的yjf339先生，您已成功申请一笔金额为40,000.00元的夸客财富增值计划，合同编号为HT9994。该笔资金将于次日起息。您可登录【夸客优富微信（Quarkfinancegroup）】或登录【夸客优富APP】进行查询。(客服热线400-680-0388)"],
            [ "10", "13510422834",  "运维部",  "核心业务", "AP2017033015480056000000", "发送成功", "亿美-才米",  "2017-04-30 16:50:57",  "【才米公社】1679!!!!!!!!!!"],
            [ "11", "13510422835",  "夸客理财",  "核心业务", "AP2017033015480056000000", "发送成功", "亿美-夸客",  "2017-04-30 17:50:57",  "【夸客金融】尊敬的yjf9779先生，您已成功申请一笔金额为800.00元的夸客财富增值计划，合同编号为HT9995。该笔资金将于次日起息。您可登录【夸客优富微信（Quarkfinancegroup）】或登录【夸客优富APP】进行查询。(客服热线400-680-0388)"],
            [ "12", "13510422836",  "运维部",  "核心业务", "AP2017033015480056000000", "发送成功", "亿美-才米",  "2017-04-30 18:50:57",  "【才米公社】1459!!!!!!!!!!"]
        ];

    });